In [ ]:
#Importações
import pandas as pd

In [ ]:
#Passando os dados do arquivo train.csv para um DataFrame
df = pd.read_csv('train.csv')

In [ ]:
#Renomeando as colunas
df.columns = ['IdPassageiro', 'Sobreviveu', 'Classe', 'Nome', 'Sexo', 'Idade', 'IrmaosConjuge',
       'PaisFilhos', 'Bilhete', 'Tarifa', 'Cabine', 'PortaoEmbarque']

In [ ]:
'''Tratando os dados do tipo string e object em letras maiúscula para melhor resultados em pesquisas
O método map faz um mapeamento por todo o DataFrame utilizando a função lambda que percorre as colunas
e quando itendifica uma coluna do tipo STR ou OBJECT ela faz o tratamento.
Se o valor não está nas características desejada o else faz deixar como está'''
df = df.map(lambda x: x.upper().strip() if isinstance(x, str or object) else x)

In [ ]:
#Formatando a coluna Tarifa para duas casas decimais
df['Tarifa'] = df['Tarifa'].round(2)

In [ ]:
#Preenchendo a coluna idade para os valores  Null e formatando a coluna para valores inteiros
df['Idade'] = df['Idade'].fillna(0)
df['Idade'] = df['Idade'].astype(int)

In [ ]:
#Calculando a média de tarifa e arredondando o valor
df['Tarifa'].mean().round()

In [ ]:
'''Calculando a média de tarifa de uma forma 'manual somando todos os valores da coluna tarida
e dividindo com o tamanho de indexes da mesma coluna'''
(df['Tarifa'].sum() / len(df['Tarifa'])).round()

In [ ]:
#Calculando a média de idade e arredondando
df['Idade'].mean().round()

In [ ]:
#Identificando o maior valor da coluna Idade com iloc
df['Idade'].iloc[df['Idade'].idxmax()]

In [ ]:
#Obtendo os dados do index do maior valor da coluna Idade utilizando loc
df[['Nome', 'Idade', 'Sexo', 'Classe', 'Sobreviveu']].loc[df['Idade'].idxmax()]

In [ ]:
"""Traduzindo os valores de uma coluna utilizando a função replace para fazer amudança no DataFrame. 
Funcionaria também da seguinte maneira:
df['Sexo'] = df['Sexo'].map({'FEMALE':'FEMININO', 'MALE':'MASCULINO'})
O que eu faço é basicamente por exemplo: Buscar os valores 'FEMALE' na coluna e mudar para 'FEMININO' e da mesma forma
para o 'MALE' transformando em 'MASCULINO'."""
df['Sexo'] = df['Sexo'].replace({'FEMALE': 'FEMININO', 'MALE':'MASCULINO'})

In [ ]:
'''Este código é somente para efeito de visualização.
Mas com este exemplo podemos fazer alterações para dois valores e transforma-los em um.'''
df['Sexo'].replace(['FEMININO','MASCULINO'], 'PESSOA')

In [ ]:
"""Aqui estamos agrupando colunas utilizando a função groupby e exibindo estatísticas baseadas nas colunas
mencionadas dentro do groupby e passando como parâmetro numeric_only=True dentro da função mean para mapear
somente as colunas que possuem valores que possibilitan cálculo mesmo que o seu cálculo não tenha uma
visualização interessante por exemplo as colunas IdPassageiro, classe, IrmaosConjuge e PaisFilhos.
Com a exibição deste dados nas colunas que mais fazem sentido podemos observar:
Taxa de sobrevivência para o sexo FEMININO = 74%
Texa de sobrevivência para o sexo MASCULINO = 18-19%
Média da idade das mulheres a bordo = 23
Média da idade dos homens a bordo = 24
Média de tarifa paga das mulheres = ₤44
Média de tarifa paga dos homens = ₤25"""
#Exibindo a média das colunas numéricas agrupadas por sexo
df.groupby('Sexo').mean(numeric_only=True)

,IdPassageiro,Sobreviveu,Classe,Idade,IrmaosConjuge,PaisFilhos,Tarifa
Sexo,,,,,,,
FEMININO,431.028662,0.742038,2.159236,23.194268,0.694268,0.649682,44.479936
MASCULINO,454.147314,0.188908,2.389948,24.103986,0.429809,0.235702,25.524073

In [ ]:
df.groupby(['Sexo','Classe']).mean(numeric_only=True)

                  IdPassageiro  Sobreviveu      Idade  IrmaosConjuge  \
Sexo      Classe
FEMININO  1         469.212766    0.968085  31.297872       0.553191
          2         443.105263    0.921053  27.960526       0.486842
          3         399.729167    0.500000  15.388889       0.895833
MASCULINO 1         455.729508    0.368852  34.163934       0.311475
          2         447.962963    0.157407  28.148148       0.342593
          3         455.515850    0.135447  19.308357       0.498559

                  PaisFilhos      Tarifa
Sexo      Classe
FEMININO  1         0.457447  106.125745
          2         0.605263   21.970132
          3         0.798611   16.119097
MASCULINO 1         0.278689   67.226066
          2         0.222222   19.741759
          3         0.224784   12.661960